TexasInstruments/ind-comms-sdk/examples/industrial_comms/ethercat_slave_beckhoff_ssc_demo/am263x-lp/r5fss0-0_freertos/example.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "AM263x_beta" --package "ZCZ" --part "AM263x" --context "r5fss0-0" --product "INDUSTRIAL_COMMUNICATIONS_SDK_AM263X@09.02.00"
 * @versions {"tool":"1.20.0_3587"}
 */

/**
 * Import the modules used in this configuration.
 */
const eeprom          = scripting.addModule("/board/eeprom/eeprom", {}, false);
const eeprom1         = eeprom.addInstance();
const flash           = scripting.addModule("/board/flash/flash", {}, false);
const flash1          = flash.addInstance();
const led             = scripting.addModule("/board/led/led", {}, false);
const led1            = led.addInstance();
const led2            = led.addInstance();
const gpio            = scripting.addModule("/drivers/gpio/gpio", {}, false);
const gpio1           = gpio.addInstance();
const gpio2           = gpio.addInstance();
const gpio3           = gpio.addInstance();
const gpio4           = gpio.addInstance();
const i2c             = scripting.addModule("/drivers/i2c/i2c", {}, false);
const i2c1            = i2c.addInstance();
const ethercat        = scripting.addModule("/industrial_comms/ethercat/ethercat", {}, false);
const ethercat1       = ethercat.addInstance();
const debug_log       = scripting.addModule("/kernel/dpl/debug_log");
const mpu_armv7       = scripting.addModule("/kernel/dpl/mpu_armv7", {}, false);
const mpu_armv71      = mpu_armv7.addInstance();
const mpu_armv72      = mpu_armv7.addInstance();
const mpu_armv73      = mpu_armv7.addInstance();
const mpu_armv74      = mpu_armv7.addInstance();
const mpu_armv75      = mpu_armv7.addInstance();
const mpu_armv76      = mpu_armv7.addInstance();
const default_linker  = scripting.addModule("/memory_configurator/default_linker", {}, false);
const default_linker1 = default_linker.addInstance();
const general         = scripting.addModule("/memory_configurator/general", {}, false);
const general1        = general.addInstance();
const region          = scripting.addModule("/memory_configurator/region", {}, false);
const region1         = region.addInstance();
const section         = scripting.addModule("/memory_configurator/section", {}, false);
const section1        = section.addInstance();
const section2        = section.addInstance();
const section3        = section.addInstance();
const section4        = section.addInstance();
const section5        = section.addInstance();
const section6        = section.addInstance();
const section7        = section.addInstance();
const section8        = section.addInstance();
const section9        = section.addInstance();
const section10       = section.addInstance();
const section11       = section.addInstance();
const section12       = section.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
eeprom1.$name      = "CONFIG_EEPROM0";
eeprom1.i2cAddress = 0x53;

flash1.$name                  = "CONFIG_FLASH0";
flash1.peripheralDriver.$name = "CONFIG_QSPI0";

led1.name       = "TPIC2810";
led1.$name      = "CONFIG_LED_DIGITAL_OUTPUT";
led1.i2cAddress = 0x61;

led2.$name = "CONFIG_LED_RUN";

const edma                         = scripting.addModule("/drivers/edma/edma", {}, false);
const edma1                        = edma.addInstance({}, false);
edma1.$name                        = "CONFIG_EDMA0";
flash1.peripheralDriver.edmaConfig = edma1;
edma1.edmaRmDmaCh[0].$name         = "CONFIG_EDMA_RM0";
edma1.edmaRmQdmaCh[0].$name        = "CONFIG_EDMA_RM1";
edma1.edmaRmTcc[0].$name           = "CONFIG_EDMA_RM2";
edma1.edmaRmParam[0].$name         = "CONFIG_EDMA_RM3";

gpio1.$name                      = "CONFIG_GPIO0";
gpio1.pinDir                     = "OUTPUT";
gpio1.GPIO.$assignAllowConflicts = "GPIO0";
gpio1.GPIO.gpioPin.$assign       = "PR0_PRU1_GPIO10";
scripting.suppress("Resource conflict,GPIO0 is also in use by @@@.+?@@@, @@@.+?@@@, @@@.+?@@@", gpio1.GPIO, "$assign");

gpio2.$name                      = "CONFIG_GPIO1";
gpio2.pinDir                     = "OUTPUT";
gpio2.GPIO.$assignAllowConflicts = "GPIO0";
gpio2.GPIO.gpioPin.$assign       = "QSPI_CSn1";
scripting.suppress("Resource conflict,GPIO0 is also in use by @@@.+?@@@, @@@.+?@@@, @@@.+?@@@", gpio2.GPIO, "$assign");

gpio3.$name                      = "CONFIG_GPIO2";
gpio3.GPIO.$assignAllowConflicts = "GPIO0";
gpio3.GPIO.gpioPin.$assign       = "EPWM7_B";
scripting.suppress("Resource conflict,GPIO0 is also in use by @@@.+?@@@, @@@.+?@@@, @@@.+?@@@", gpio3.GPIO, "$assign");

gpio4.$name                      = "CONFIG_GPIO3";
gpio4.pinDir                     = "OUTPUT";
led2.peripheralDriver            = gpio4;
gpio4.GPIO.$assignAllowConflicts = "GPIO0";
gpio4.GPIO.gpioPin.$assign       = "UART0_CTSn";
scripting.suppress("Resource conflict,GPIO0 is also in use by @@@.+?@@@, @@@.+?@@@, @@@.+?@@@", gpio4.GPIO, "$assign");

i2c1.$name               = "CONFIG_I2C1";
eeprom1.peripheralDriver = i2c1;
led1.peripheralDriver    = i2c1;
i2c1.I2C.$assign         = "I2C1";
i2c1.I2C.SCL.$assign     = "I2C1_SCL";
i2c1.I2C.SDA.$assign     = "I2C1_SDA";

ethercat1.$name                       = "CONFIG_ETHERCAT0";
ethercat1.ICSSM.PR0_PRU1_GPIO10.$used = false;
ethercat1.ethphy[0].$name             = "CONFIG_ETHPHY0";
ethercat1.ethphy[0].mdioPort          = 12;
ethercat1.ethphy[1].$name             = "CONFIG_ETHPHY1";
ethercat1.ethphy[1].mdioPort          = 3;

const pruicss                            = scripting.addModule("/drivers/pruicss/pruicss", {}, false);
const pruicss1                           = pruicss.addInstance({}, false);
pruicss1.$name                           = "CONFIG_PRU_ICSS0";
ethercat1.icss                           = pruicss1;
pruicss1.AdditionalICSSSettings[0].$name = "CONFIG_PRU_ICSS_IO1";

debug_log.enableUartLog            = true;
debug_log.enableCssLog             = false;
debug_log.uartLog.$name            = "CONFIG_UART0";
debug_log.uartLog.UART.$assign     = "UART0";
debug_log.uartLog.UART.RXD.$assign = "UART0_RXD";
debug_log.uartLog.UART.TXD.$assign = "UART0_TXD";
debug_log.uartLog.child.$name      = "drivers_uart_v2_uart_v2_template0";

mpu_armv71.$name             = "CONFIG_MPU_REGION0";
mpu_armv71.size              = 31;
mpu_armv71.attributes        = "Device";
mpu_armv71.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv71.allowExecute      = false;

